import Timeline from "./Timeline";

export default function History() {
  return (
    <section
      className="relative bg-cover bg-center py-28 "
      style={{ backgroundImage: "url('/backgrounds/timeline_bg_1.png')" }}
    >
      <div className="absolute inset-0 bg-[#0D2853] opacity-95"></div>
      <div className="relative z-10 text-white text-center p-6">
        <h2 className="text-3xl font-bold text-cgreen block">تاريخنا</h2>
        <div className="mt-6 mx-auto max-w-7xl text-justify lg:text-center md:text-lg xl:text-xl">
تأسس وقف أهداف الخيري في عام 2012 ليكون منارة للتعليم والتنمية المجتمعية، ملتزمًا بتحقيق أهدافه النبيلة في خدمة المجتمع وتعزيز قيم التعاون والتكافل. ومنذ نشأته، سعى الوقف إلى تحقيق تأثير إيجابي ومستدام على حياة الأفراد والمجتمعات من خلال توفير فرص تعليمية متطورة ومبادرات تنموية مبتكرة. فيما يلي محطات بارزة من مسيرة الوقف:        </div>

        <h2 className="text-3xl font-bold text-cgreen block my-8">
          معالم مؤسسة أهداف الخيرية
        </h2>
        <Timeline
          achievements={[
            {
              year: 2012,
              title: "إطلاق مؤسسة علمني",
              description: `في عام 2012، أُطلقت مؤسسة "علمني" كأحد أوائل مشاريع الوقف. تهدف المؤسسة إلى تقديم منح جامعية للطلاب الطموحين وتوفير برامج متخصصة لدعم المهارات وبناء القدرات. تعمل المؤسسة على تمكين الطلاب ليصبحوا قادةً صالحين ومصلحين في مجتمعاتهم، مسهمين بذلك في تحقيق التنمية المستدامة.

              من خلال "علمني"، تم تدريب مئات الشباب على المهارات القيادية والاجتماعية، مما ساعدهم على خوض غمار الحياة المهنية والمساهمة بفعالية في تطوير مجتمعاتهم.`
            },
            {
              year: 2013,
              title: "تأسيس أكاديمية \"إشراقة\"",
              description: "في عام 2013، تم إطلاق \"أكاديمية إشراقة\" لدعم الطلاب في المراحل التعليمية المختلفة من الابتدائية إلى الثانوية.\n\nتهدف الأكاديمية إلى:\n• تقديم الدعم الأكاديمي الشامل.\n• توفير بيئة تعليمية آمنة ومحفزة.\n• تعزيز ثقة الطلاب بأنفسهم وتمكينهم من تحقيق إمكاناتهم الكاملة.\n\nاستطاعت الأكاديمية أن تصبح منصة متكاملة تدعم الطلاب على المستوى التعليمي والنفسي، مما جعلها واحدة من المبادرات الرائدة في تعزيز التعليم المدرسي."
            },
            {
              year: 2015,
              title:
                "افتتاح مركز \"أجود\" لتطوير المدارس",
              description:
                "في عام 2015، افتتح وقف أهداف الخيري مركز \"أجود\" اللبناني ليكون رائدًا في تطوير المدارس وتعزيز جودة التعليم. يقدم المركز تدريبات شاملة ومتخصصة للمعلمين والكادر التعليمي، ويركز على:\n• تطبيق أساليب التعليم النشط.\n• مواكبة التطورات الحديثة في مجال التعليم.\n• تحسين البيئة التعليمية بما ينعكس إيجابًا على أداء الطلاب.\n\nساهم المركز في تطوير مئات المدارس في المنطقة، مما عزز جودة التعليم وأحدث تغييرًا إيجابيًا ملموسًا.",
            },
            {
              year: 2022,
              title: "تأسيس مدرسة أهداف",
              description:
                "في عام 2022، ومع تعمّق الأزمة الاقتصادية في لبنان، استجبنا من خلال تأسيس مدرسة أهداف. تهدف إلى توفير بيئة تعليمية ميسورة التكلفة وداعمة للأسر، مستندة إلى القيم الإسلامية. بالرغم من التحديات، تضمن مدرسة أهداف الوصول إلى تعليم ذي جودة عالية، مجسدةً التزامنا الراسخ تجاه المجتمع.",
            },
            {
              year: 2023,
              title: "إطلاق أكاديمية \"إشراقة علم\" ",
              description: "استقلت أكاديمية \"إشراقة\" لتؤسس كيانها الخاص الذي يركز على دعم طلاب المرحلة الثانوية. تقدم المؤسسة برامج متخصصة تهدف إلى:\n• دعم الطلاب أكاديميًا\n• تنمية مهاراتهم الشخصية والمهنية\n• إعدادهم لمستقبل واعد من خلال التوجيه الأكاديمي والمهني"
            },
            {
              year: 2024,
              title: "افتتاح نادي \"نادي علمني للشباب الجامعي\"",
              description: "\"نادي علمني\" هو مكان موجهة للشباب تُمكّنهم من التركيز على تحقيق طموحاتهم التعليمية والشخصية. يقدم النادي مجموعة متنوعة من الأنشطة:\n• تنظيم دورات تدريبية خارجية لتنمية المهارات.\n• توفير مساحات آمنة للدراسة والإبداع.\n• إنشاء نوادٍ متخصصة مثل نادي الشطرنج، نادي القرآن الكريم، ونادي الرسم.\n\nيهدف النادي إلى تحفيز الشباب على تحقيق طموحاتهم وتعزيز مشاركتهم الإيجابية في المجتمع."
            },
          ]}
        />
        <h2 className="text-3xl font-bold text-cgreen block my-8 uppercase">
          رؤية مستدامة للمستقبل
        </h2>
        <div className="mt-6 mx-auto max-w-7xl text-justify lg:text-center md:text-lg xl:text-xl">
          منذ تأسيسه، استمر وقف أهداف الخيري في النمو والابتكار، مستلهمًا
           رؤيته &quot;نطور الانسان ليطور العالم&quot; ورسالته من بناء قيم 
          العطاء والتنمية. وبتوفيق الله ثم بجهود فريقه وشركائه، يواصل
           الوقف مسيرته في بناء جيل متعلم ومتمكن يسهم في نهضة مجتمعه،
           ملتزمًا بتحقيق رؤيته في دعم التعليم والتنمية المستدامة.
        </div>
      </div>
    </section>
  );
}
